technicalinformatics/msp430gcc/lib/gcc/msp430-elf/5.3.0/plugin/include/options.h
#define CL_C          (1U << 0)
#define CL_CXX        (1U << 1)
#define CL_Fortran    (1U << 2)
#define CL_Go         (1U << 3)
#define CL_LTO        (1U << 4)
#define CL_ObjC       (1U << 5)
#define CL_ObjCXX     (1U << 6)
#define CL_LANG_ALL   ((1U << 7) - 1)

enum opt_code
{
  OPT____ = 0,                               /* -### */
  /* OPT__all_warnings = 1, */               /* --all-warnings */
  /* OPT__ansi = 2, */                       /* --ansi */
  /* OPT__assemble = 3, */                   /* --assemble */
  /* OPT__assert = 4, */                     /* --assert */
  /* OPT__assert_ = 5, */                    /* --assert= */
  /* OPT__comments = 6, */                   /* --comments */
  /* OPT__comments_in_macros = 7, */         /* --comments-in-macros */
  /* OPT__compile = 8, */                    /* --compile */
  /* OPT__coverage = 9, */                   /* --coverage */
  /* OPT__debug = 10, */                     /* --debug */
  /* OPT__define_macro = 11, */              /* --define-macro */
  /* OPT__define_macro_ = 12, */             /* --define-macro= */
  /* OPT__dependencies = 13, */              /* --dependencies */
  /* OPT__dump = 14, */                      /* --dump */
  /* OPT__dump_ = 15, */                     /* --dump= */
  /* OPT__dumpbase = 16, */                  /* --dumpbase */
  /* OPT__dumpdir = 17, */                   /* --dumpdir */
  /* OPT__entry = 18, */                     /* --entry */
  /* OPT__entry_ = 19, */                    /* --entry= */
  /* OPT__extra_warnings = 20, */            /* --extra-warnings */
  /* OPT__for_assembler = 21, */             /* --for-assembler */
  /* OPT__for_assembler_ = 22, */            /* --for-assembler= */
  /* OPT__for_linker = 23, */                /* --for-linker */
  /* OPT__for_linker_ = 24, */               /* --for-linker= */
  /* OPT__force_link = 25, */                /* --force-link */
  /* OPT__force_link_ = 26, */               /* --force-link= */
  OPT__help = 27,                            /* --help */
  OPT__help_ = 28,                           /* --help= */
  /* OPT__imacros = 29, */                   /* --imacros */
  /* OPT__imacros_ = 30, */                  /* --imacros= */
  /* OPT__include = 31, */                   /* --include */
  /* OPT__include_barrier = 32, */           /* --include-barrier */
  /* OPT__include_directory = 33, */         /* --include-directory */
  /* OPT__include_directory_after = 34, */   /* --include-directory-after */
  /* OPT__include_directory_after_ = 35, */  /* --include-directory-after= */
  /* OPT__include_directory_ = 36, */        /* --include-directory= */
  /* OPT__include_prefix = 37, */            /* --include-prefix */
  /* OPT__include_prefix_ = 38, */           /* --include-prefix= */
  /* OPT__include_with_prefix = 39, */       /* --include-with-prefix */
  /* OPT__include_with_prefix_after = 40, */ /* --include-with-prefix-after */
  /* OPT__include_with_prefix_after_ = 41, *//* --include-with-prefix-after= */
  /* OPT__include_with_prefix_before = 42, *//* --include-with-prefix-before */
  /* OPT__include_with_prefix_before_ = 43, *//* --include-with-prefix-before= */
  /* OPT__include_with_prefix_ = 44, */      /* --include-with-prefix= */
  /* OPT__include_ = 45, */                  /* --include= */
  /* OPT__language = 46, */                  /* --language */
  /* OPT__language_ = 47, */                 /* --language= */
  /* OPT__library_directory = 48, */         /* --library-directory */
  /* OPT__library_directory_ = 49, */        /* --library-directory= */
  /* OPT__no_canonical_prefixes = 50, */     /* --no-canonical-prefixes */
  /* OPT__no_integrated_cpp = 51, */         /* --no-integrated-cpp */
  /* OPT__no_line_commands = 52, */          /* --no-line-commands */
  /* OPT__no_standard_includes = 53, */      /* --no-standard-includes */
  /* OPT__no_standard_libraries = 54, */     /* --no-standard-libraries */
  OPT__no_sysroot_suffix = 55,               /* --no-sysroot-suffix */
  /* OPT__no_warnings = 56, */               /* --no-warnings */
  /* OPT__optimize = 57, */                  /* --optimize */
  /* OPT__output = 58, */                    /* --output */
  OPT__output_pch_ = 59,                     /* --output-pch= */
  /* OPT__output_ = 60, */                   /* --output= */
  OPT__param = 61,                           /* --param */
  /* OPT__param_ = 62, */                    /* --param= */
  /* OPT__pass_exit_codes = 63, */           /* --pass-exit-codes */
  /* OPT__pedantic = 64, */                  /* --pedantic */
  /* OPT__pedantic_errors = 65, */           /* --pedantic-errors */
  /* OPT__pie = 66, */                       /* --pie */
  /* OPT__pipe = 67, */                      /* --pipe */
  /* OPT__prefix = 68, */                    /* --prefix */
  /* OPT__prefix_ = 69, */                   /* --prefix= */
  /* OPT__preprocess = 70, */                /* --preprocess */
  /* OPT__print_file_name = 71, */           /* --print-file-name */
  /* OPT__print_file_name_ = 72, */          /* --print-file-name= */
  /* OPT__print_libgcc_file_name = 73, */    /* --print-libgcc-file-name */
  /* OPT__print_missing_file_dependencies = 74, *//* --print-missing-file-dependencies */
  /* OPT__print_multi_directory = 75, */     /* --print-multi-directory */
  /* OPT__print_multi_lib = 76, */           /* --print-multi-lib */
  /* OPT__print_multi_os_directory = 77, */  /* --print-multi-os-directory */
  /* OPT__print_multiarch = 78, */           /* --print-multiarch */
  /* OPT__print_prog_name = 79, */           /* --print-prog-name */
  /* OPT__print_prog_name_ = 80, */          /* --print-prog-name= */
  /* OPT__print_search_dirs = 81, */         /* --print-search-dirs */
  /* OPT__print_sysroot = 82, */             /* --print-sysroot */
  /* OPT__print_sysroot_headers_suffix = 83, *//* --print-sysroot-headers-suffix */
  /* OPT__profile = 84, */                   /* --profile */
  /* OPT__save_temps = 85, */                /* --save-temps */
  /* OPT__shared = 86, */                    /* --shared */
  /* OPT__specs = 87, */                     /* --specs */
  /* OPT__specs_ = 88, */                    /* --specs= */
  /* OPT__static = 89, */                    /* --static */
  /* OPT__symbolic = 90, */                  /* --symbolic */
  /* OPT__sysroot = 91, */                   /* --sysroot */
  OPT__sysroot_ = 92,                        /* --sysroot= */
  OPT__target_help = 93,                     /* --target-help */
  /* OPT__time = 94, */                      /* --time */
  /* OPT__trace_includes = 95, */            /* --trace-includes */
  /* OPT__traditional = 96, */               /* --traditional */
  /* OPT__traditional_cpp = 97, */           /* --traditional-cpp */
  /* OPT__trigraphs = 98, */                 /* --trigraphs */
  /* OPT__undefine_macro = 99, */            /* --undefine-macro */
  /* OPT__undefine_macro_ = 100, */          /* --undefine-macro= */
  /* OPT__user_dependencies = 101, */        /* --user-dependencies */
  /* OPT__verbose = 102, */                  /* --verbose */
  OPT__version = 103,                        /* --version */
  /* OPT__write_dependencies = 104, */       /* --write-dependencies */
  /* OPT__write_user_dependencies = 105, */  /* --write-user-dependencies */
  OPT_A = 106,                               /* -A */
  OPT_B = 107,                               /* -B */
  OPT_C = 108,                               /* -C */
  OPT_CC = 109,                              /* -CC */
  OPT_D = 110,                               /* -D */
  OPT_E = 111,                               /* -E */
  OPT_F = 112,                               /* -F */
  OPT_H = 113,                               /* -H */
  OPT_I = 114,                               /* -I */
  OPT_J = 115,                               /* -J */
  OPT_L = 116,                               /* -L */
  OPT_M = 117,                               /* -M */
  OPT_MD = 118,                              /* -MD */
  OPT_MF = 119,                              /* -MF */
  OPT_MG = 120,                              /* -MG */
  OPT_MM = 121,                              /* -MM */
  OPT_MMD = 122,                             /* -MMD */
  OPT_MP = 123,                              /* -MP */
  OPT_MQ = 124,                              /* -MQ */
  OPT_MT = 125,                              /* -MT */
  OPT_N = 126,                               /* -N */
  OPT_O = 127,                               /* -O */
  OPT_Ofast = 128,                           /* -Ofast */
  OPT_Og = 129,                              /* -Og */
  OPT_Os = 130,                              /* -Os */
  OPT_P = 131,                               /* -P */
  OPT_Q = 132,                               /* -Q */
  OPT_Qn = 133,                              /* -Qn */
  OPT_Qy = 134,                              /* -Qy */
  OPT_R = 135,                               /* -R */
  OPT_S = 136,                               /* -S */
  OPT_T = 137,                               /* -T */
  OPT_Tbss = 138,                            /* -Tbss */
  OPT_Tbss_ = 139,                           /* -Tbss= */
  OPT_Tdata = 140,                           /* -Tdata */
  OPT_Tdata_ = 141,                          /* -Tdata= */
  OPT_Ttext = 142,                           /* -Ttext */
  OPT_Ttext_ = 143,                          /* -Ttext= */
  OPT_U = 144,                               /* -U */
  /* OPT_W = 145, */                         /* -W */
  OPT_Wa_ = 146,                             /* -Wa, */
  OPT_Wabi = 147,                            /* -Wabi */
  OPT_Wabi_tag = 148,                        /* -Wabi-tag */
  OPT_Wabi_ = 149,                           /* -Wabi= */
  OPT_Waddress = 150,                        /* -Waddress */
  OPT_Waggregate_return = 151,               /* -Waggregate-return */
  OPT_Waggressive_loop_optimizations = 152,  /* -Waggressive-loop-optimizations */
  OPT_Waliasing = 153,                       /* -Waliasing */
  OPT_Walign_commons = 154,                  /* -Walign-commons */
  OPT_Wall = 155,                            /* -Wall */
  OPT_Wampersand = 156,                      /* -Wampersand */
  OPT_Warray_bounds = 157,                   /* -Warray-bounds */
  OPT_Warray_bounds_ = 158,                  /* -Warray-bounds= */
  OPT_Warray_temporaries = 159,              /* -Warray-temporaries */
  OPT_Wassign_intercept = 160,               /* -Wassign-intercept */
  OPT_Wattributes = 161,                     /* -Wattributes */
  OPT_Wbad_function_cast = 162,              /* -Wbad-function-cast */
  OPT_Wbool_compare = 163,                   /* -Wbool-compare */
  OPT_Wbuiltin_macro_redefined = 164,        /* -Wbuiltin-macro-redefined */
  OPT_Wc___compat = 165,                     /* -Wc++-compat */
  OPT_Wc__0x_compat = 166,                   /* -Wc++0x-compat */
  /* OPT_Wc__11_compat = 167, */             /* -Wc++11-compat */
  OPT_Wc__14_compat = 168,                   /* -Wc++14-compat */
  OPT_Wc_binding_type = 169,                 /* -Wc-binding-type */
  OPT_Wc90_c99_compat = 170,                 /* -Wc90-c99-compat */
  OPT_Wc99_c11_compat = 171,                 /* -Wc99-c11-compat */
  OPT_Wcast_align = 172,                     /* -Wcast-align */
  OPT_Wcast_qual = 173,                      /* -Wcast-qual */
  OPT_Wchar_subscripts = 174,                /* -Wchar-subscripts */
  OPT_Wcharacter_truncation = 175,           /* -Wcharacter-truncation */
  OPT_Wchkp = 176,                           /* -Wchkp */
  OPT_Wclobbered = 177,                      /* -Wclobbered */
  OPT_Wcomment = 178,                        /* -Wcomment */
  /* OPT_Wcomments = 179, */                 /* -Wcomments */
  OPT_Wcompare_reals = 180,                  /* -Wcompare-reals */
  OPT_Wconditionally_supported = 181,        /* -Wconditionally-supported */
  OPT_Wconversion = 182,                     /* -Wconversion */
  OPT_Wconversion_extra = 183,               /* -Wconversion-extra */
  OPT_Wconversion_null = 184,                /* -Wconversion-null */
  OPT_Wcoverage_mismatch = 185,              /* -Wcoverage-mismatch */
  OPT_Wcpp = 186,                            /* -Wcpp */
  OPT_Wctor_dtor_privacy = 187,              /* -Wctor-dtor-privacy */
  OPT_Wdate_time = 188,                      /* -Wdate-time */
  OPT_Wdeclaration_after_statement = 189,    /* -Wdeclaration-after-statement */
  OPT_Wdelete_incomplete = 190,              /* -Wdelete-incomplete */
  OPT_Wdelete_non_virtual_dtor = 191,        /* -Wdelete-non-virtual-dtor */
  OPT_Wdeprecated = 192,                     /* -Wdeprecated */
  OPT_Wdeprecated_declarations = 193,        /* -Wdeprecated-declarations */
  OPT_Wdesignated_init = 194,                /* -Wdesignated-init */
  OPT_Wdisabled_optimization = 195,          /* -Wdisabled-optimization */
  OPT_Wdiscarded_array_qualifiers = 196,     /* -Wdiscarded-array-qualifiers */
  OPT_Wdiscarded_qualifiers = 197,           /* -Wdiscarded-qualifiers */
  OPT_Wdiv_by_zero = 198,                    /* -Wdiv-by-zero */
  OPT_Wdouble_promotion = 199,               /* -Wdouble-promotion */
  OPT_Weffc__ = 200,                         /* -Weffc++ */
  OPT_Wempty_body = 201,                     /* -Wempty-body */
  OPT_Wendif_labels = 202,                   /* -Wendif-labels */
  OPT_Wenum_compare = 203,                   /* -Wenum-compare */
  OPT_Werror = 204,                          /* -Werror */
  /* OPT_Werror_implicit_function_declaration = 205, *//* -Werror-implicit-function-declaration */
  OPT_Werror_ = 206,                         /* -Werror= */
  OPT_Wextra = 207,                          /* -Wextra */
  OPT_Wfatal_errors = 208,                   /* -Wfatal-errors */
  OPT_Wfloat_conversion = 209,               /* -Wfloat-conversion */
  OPT_Wfloat_equal = 210,                    /* -Wfloat-equal */
  /* OPT_Wformat = 211, */                   /* -Wformat */
  OPT_Wformat_contains_nul = 212,            /* -Wformat-contains-nul */
  OPT_Wformat_extra_args = 213,              /* -Wformat-extra-args */
  OPT_Wformat_nonliteral = 214,              /* -Wformat-nonliteral */
  OPT_Wformat_security = 215,                /* -Wformat-security */
  OPT_Wformat_signedness = 216,              /* -Wformat-signedness */
  OPT_Wformat_y2k = 217,                     /* -Wformat-y2k */
  OPT_Wformat_zero_length = 218,             /* -Wformat-zero-length */
  OPT_Wformat_ = 219,                        /* -Wformat= */
  OPT_Wframe_larger_than_ = 220,             /* -Wframe-larger-than= */
  OPT_Wfree_nonheap_object = 221,            /* -Wfree-nonheap-object */
  OPT_Wfunction_elimination = 222,           /* -Wfunction-elimination */
  OPT_Wignored_qualifiers = 223,             /* -Wignored-qualifiers */
  OPT_Wimplicit = 224,                       /* -Wimplicit */
  OPT_Wimplicit_function_declaration = 225,  /* -Wimplicit-function-declaration */
  OPT_Wimplicit_int = 226,                   /* -Wimplicit-int */
  OPT_Wimplicit_interface = 227,             /* -Wimplicit-interface */
  OPT_Wimplicit_procedure = 228,             /* -Wimplicit-procedure */
  /* OPT_Wimport = 229, */                   /* -Wimport */
  OPT_Wincompatible_pointer_types = 230,     /* -Wincompatible-pointer-types */
  OPT_Winherited_variadic_ctor = 231,        /* -Winherited-variadic-ctor */
  OPT_Winit_self = 232,                      /* -Winit-self */
  OPT_Winline = 233,                         /* -Winline */
  OPT_Wint_conversion = 234,                 /* -Wint-conversion */
  OPT_Wint_to_pointer_cast = 235,            /* -Wint-to-pointer-cast */
  OPT_Wintrinsic_shadow = 236,               /* -Wintrinsic-shadow */
  OPT_Wintrinsics_std = 237,                 /* -Wintrinsics-std */
  OPT_Winvalid_memory_model = 238,           /* -Winvalid-memory-model */
  OPT_Winvalid_offsetof = 239,               /* -Winvalid-offsetof */
  OPT_Winvalid_pch = 240,                    /* -Winvalid-pch */
  OPT_Wjump_misses_init = 241,               /* -Wjump-misses-init */
  OPT_Wl_ = 242,                             /* -Wl, */
  /* OPT_Wlarger_than_ = 243, */             /* -Wlarger-than- */
  OPT_Wlarger_than_ = 244,                   /* -Wlarger-than= */
  OPT_Wline_truncation = 245,                /* -Wline-truncation */
  OPT_Wliteral_suffix = 246,                 /* -Wliteral-suffix */
  OPT_Wlogical_not_parentheses = 247,        /* -Wlogical-not-parentheses */
  OPT_Wlogical_op = 248,                     /* -Wlogical-op */
  OPT_Wlong_long = 249,                      /* -Wlong-long */
  OPT_Wmain = 250,                           /* -Wmain */
  OPT_Wmaybe_uninitialized = 251,            /* -Wmaybe-uninitialized */
  OPT_Wmemset_transposed_args = 252,         /* -Wmemset-transposed-args */
  OPT_Wmissing_braces = 253,                 /* -Wmissing-braces */
  OPT_Wmissing_declarations = 254,           /* -Wmissing-declarations */
  OPT_Wmissing_field_initializers = 255,     /* -Wmissing-field-initializers */
  /* OPT_Wmissing_format_attribute = 256, */ /* -Wmissing-format-attribute */
  OPT_Wmissing_include_dirs = 257,           /* -Wmissing-include-dirs */
  /* OPT_Wmissing_noreturn = 258, */         /* -Wmissing-noreturn */
  OPT_Wmissing_parameter_type = 259,         /* -Wmissing-parameter-type */
  OPT_Wmissing_prototypes = 260,             /* -Wmissing-prototypes */
  /* OPT_Wmudflap = 261, */                  /* -Wmudflap */
  OPT_Wmultichar = 262,                      /* -Wmultichar */
  OPT_Wnarrowing = 263,                      /* -Wnarrowing */
  OPT_Wnested_externs = 264,                 /* -Wnested-externs */
  OPT_Wnoexcept = 265,                       /* -Wnoexcept */
  OPT_Wnon_template_friend = 266,            /* -Wnon-template-friend */
  OPT_Wnon_virtual_dtor = 267,               /* -Wnon-virtual-dtor */
  OPT_Wnonnull = 268,                        /* -Wnonnull */
  /* OPT_Wnormalized = 269, */               /* -Wnormalized */
  OPT_Wnormalized_ = 270,                    /* -Wnormalized= */
  OPT_Wodr = 271,                            /* -Wodr */
  OPT_Wold_style_cast = 272,                 /* -Wold-style-cast */
  OPT_Wold_style_declaration = 273,          /* -Wold-style-declaration */
  OPT_Wold_style_definition = 274,           /* -Wold-style-definition */
  OPT_Wopenmp_simd = 275,                    /* -Wopenmp-simd */
  OPT_Woverflow = 276,                       /* -Woverflow */
  OPT_Woverlength_strings = 277,             /* -Woverlength-strings */
  OPT_Woverloaded_virtual = 278,             /* -Woverloaded-virtual */
  OPT_Woverride_init = 279,                  /* -Woverride-init */
  OPT_Wp_ = 280,                             /* -Wp, */
  OPT_Wpacked = 281,                         /* -Wpacked */
  OPT_Wpacked_bitfield_compat = 282,         /* -Wpacked-bitfield-compat */
  OPT_Wpadded = 283,                         /* -Wpadded */
  OPT_Wparentheses = 284,                    /* -Wparentheses */
  OPT_Wpedantic = 285,                       /* -Wpedantic */
  OPT_Wpmf_conversions = 286,                /* -Wpmf-conversions */
  OPT_Wpointer_arith = 287,                  /* -Wpointer-arith */
  OPT_Wpointer_sign = 288,                   /* -Wpointer-sign */
  OPT_Wpointer_to_int_cast = 289,            /* -Wpointer-to-int-cast */
  OPT_Wpragmas = 290,                        /* -Wpragmas */
  OPT_Wproperty_assign_default = 291,        /* -Wproperty-assign-default */
  OPT_Wprotocol = 292,                       /* -Wprotocol */
  OPT_Wpsabi = 293,                          /* -Wpsabi */
  OPT_Wreal_q_constant = 294,                /* -Wreal-q-constant */
  OPT_Wrealloc_lhs = 295,                    /* -Wrealloc-lhs */
  OPT_Wrealloc_lhs_all = 296,                /* -Wrealloc-lhs-all */
  OPT_Wredundant_decls = 297,                /* -Wredundant-decls */
  OPT_Wreorder = 298,                        /* -Wreorder */
  OPT_Wreturn_local_addr = 299,              /* -Wreturn-local-addr */
  OPT_Wreturn_type = 300,                    /* -Wreturn-type */
  OPT_Wselector = 301,                       /* -Wselector */
  OPT_Wsequence_point = 302,                 /* -Wsequence-point */
  OPT_Wshadow = 303,                         /* -Wshadow */
  OPT_Wshadow_ivar = 304,                    /* -Wshadow-ivar */
  OPT_Wshift_count_negative = 305,           /* -Wshift-count-negative */
  OPT_Wshift_count_overflow = 306,           /* -Wshift-count-overflow */
  OPT_Wsign_compare = 307,                   /* -Wsign-compare */
  OPT_Wsign_conversion = 308,                /* -Wsign-conversion */
  OPT_Wsign_promo = 309,                     /* -Wsign-promo */
  OPT_Wsized_deallocation = 310,             /* -Wsized-deallocation */
  OPT_Wsizeof_array_argument = 311,          /* -Wsizeof-array-argument */
  OPT_Wsizeof_pointer_memaccess = 312,       /* -Wsizeof-pointer-memaccess */
  OPT_Wstack_protector = 313,                /* -Wstack-protector */
  OPT_Wstack_usage_ = 314,                   /* -Wstack-usage= */
  OPT_Wstrict_aliasing = 315,                /* -Wstrict-aliasing */
  OPT_Wstrict_aliasing_ = 316,               /* -Wstrict-aliasing= */
  OPT_Wstrict_null_sentinel = 317,           /* -Wstrict-null-sentinel */
  OPT_Wstrict_overflow = 318,                /* -Wstrict-overflow */
  OPT_Wstrict_overflow_ = 319,               /* -Wstrict-overflow= */
  OPT_Wstrict_prototypes = 320,              /* -Wstrict-prototypes */
  OPT_Wstrict_selector_match = 321,          /* -Wstrict-selector-match */
  OPT_Wsuggest_attribute_const = 322,        /* -Wsuggest-attribute=const */
  OPT_Wsuggest_attribute_format = 323,       /* -Wsuggest-attribute=format */
  OPT_Wsuggest_attribute_noreturn = 324,     /* -Wsuggest-attribute=noreturn */
  OPT_Wsuggest_attribute_pure = 325,         /* -Wsuggest-attribute=pure */
  OPT_Wsuggest_final_methods = 326,          /* -Wsuggest-final-methods */
  OPT_Wsuggest_final_types = 327,            /* -Wsuggest-final-types */
  OPT_Wsuggest_override = 328,               /* -Wsuggest-override */
  OPT_Wsurprising = 329,                     /* -Wsurprising */
  OPT_Wswitch = 330,                         /* -Wswitch */
  OPT_Wswitch_bool = 331,                    /* -Wswitch-bool */
  OPT_Wswitch_default = 332,                 /* -Wswitch-default */
  OPT_Wswitch_enum = 333,                    /* -Wswitch-enum */
  OPT_Wsync_nand = 334,                      /* -Wsync-nand */
  OPT_Wsynth = 335,                          /* -Wsynth */
  OPT_Wsystem_headers = 336,                 /* -Wsystem-headers */
  OPT_Wtabs = 337,                           /* -Wtabs */
  OPT_Wtarget_lifetime = 338,                /* -Wtarget-lifetime */
  OPT_Wtraditional = 339,                    /* -Wtraditional */
  OPT_Wtraditional_conversion = 340,         /* -Wtraditional-conversion */
  OPT_Wtrampolines = 341,                    /* -Wtrampolines */
  OPT_Wtrigraphs = 342,                      /* -Wtrigraphs */
  OPT_Wtype_limits = 343,                    /* -Wtype-limits */
  OPT_Wundeclared_selector = 344,            /* -Wundeclared-selector */
  OPT_Wundef = 345,                          /* -Wundef */
  OPT_Wunderflow = 346,                      /* -Wunderflow */
  OPT_Wuninitialized = 347,                  /* -Wuninitialized */
  OPT_Wunknown_pragmas = 348,                /* -Wunknown-pragmas */
  /* OPT_Wunreachable_code = 349, */         /* -Wunreachable-code */
  OPT_Wunsafe_loop_optimizations = 350,      /* -Wunsafe-loop-optimizations */
  OPT_Wunsuffixed_float_constants = 351,     /* -Wunsuffixed-float-constants */
  OPT_Wunused = 352,                         /* -Wunused */
  OPT_Wunused_but_set_parameter = 353,       /* -Wunused-but-set-parameter */
  OPT_Wunused_but_set_variable = 354,        /* -Wunused-but-set-variable */
  OPT_Wunused_dummy_argument = 355,          /* -Wunused-dummy-argument */
  OPT_Wunused_function = 356,                /* -Wunused-function */
  OPT_Wunused_label = 357,                   /* -Wunused-label */
