technicalinformatics/msp430gcc/lib/gcc/msp430-elf/5.3.0/plugin/include/options.h
  OPT_Wunused_local_typedefs = 358,          /* -Wunused-local-typedefs */
  OPT_Wunused_macros = 359,                  /* -Wunused-macros */
  OPT_Wunused_parameter = 360,               /* -Wunused-parameter */
  OPT_Wunused_result = 361,                  /* -Wunused-result */
  OPT_Wunused_value = 362,                   /* -Wunused-value */
  OPT_Wunused_variable = 363,                /* -Wunused-variable */
  OPT_Wuse_without_only = 364,               /* -Wuse-without-only */
  OPT_Wuseless_cast = 365,                   /* -Wuseless-cast */
  OPT_Wvarargs = 366,                        /* -Wvarargs */
  OPT_Wvariadic_macros = 367,                /* -Wvariadic-macros */
  OPT_Wvector_operation_performance = 368,   /* -Wvector-operation-performance */
  OPT_Wvirtual_move_assign = 369,            /* -Wvirtual-move-assign */
  OPT_Wvla = 370,                            /* -Wvla */
  OPT_Wvolatile_register_var = 371,          /* -Wvolatile-register-var */
  OPT_Wwrite_strings = 372,                  /* -Wwrite-strings */
  OPT_Wzero_as_null_pointer_constant = 373,  /* -Wzero-as-null-pointer-constant */
  OPT_Wzerotrip = 374,                       /* -Wzerotrip */
  OPT_Xassembler = 375,                      /* -Xassembler */
  OPT_Xlinker = 376,                         /* -Xlinker */
  OPT_Xpreprocessor = 377,                   /* -Xpreprocessor */
  OPT_Z = 378,                               /* -Z */
  OPT_ansi = 379,                            /* -ansi */
  OPT_aux_info = 380,                        /* -aux-info */
  /* OPT_aux_info_ = 381, */                 /* -aux-info= */
  OPT_auxbase = 382,                         /* -auxbase */
  OPT_auxbase_strip = 383,                   /* -auxbase-strip */
  OPT_c = 384,                               /* -c */
  OPT_coverage = 385,                        /* -coverage */
  OPT_cpp = 386,                             /* -cpp */
  OPT_cpp_ = 387,                            /* -cpp= */
  OPT_d = 388,                               /* -d */
  OPT_dumpbase = 389,                        /* -dumpbase */
  OPT_dumpdir = 390,                         /* -dumpdir */
  OPT_dumpmachine = 391,                     /* -dumpmachine */
  OPT_dumpspecs = 392,                       /* -dumpspecs */
  OPT_dumpversion = 393,                     /* -dumpversion */
  OPT_e = 394,                               /* -e */
  OPT_export_dynamic = 395,                  /* -export-dynamic */
  OPT_fPIC = 396,                            /* -fPIC */
  OPT_fPIE = 397,                            /* -fPIE */
  OPT_fabi_compat_version_ = 398,            /* -fabi-compat-version= */
  OPT_fabi_version_ = 399,                   /* -fabi-version= */
  OPT_faccess_control = 400,                 /* -faccess-control */
  OPT_fada_spec_parent_ = 401,               /* -fada-spec-parent= */
  OPT_faggressive_function_elimination = 402,/* -faggressive-function-elimination */
  OPT_faggressive_loop_optimizations = 403,  /* -faggressive-loop-optimizations */
  OPT_falign_commons = 404,                  /* -falign-commons */
  OPT_falign_functions = 405,                /* -falign-functions */
  OPT_falign_functions_ = 406,               /* -falign-functions= */
  OPT_falign_jumps = 407,                    /* -falign-jumps */
  OPT_falign_jumps_ = 408,                   /* -falign-jumps= */
  OPT_falign_labels = 409,                   /* -falign-labels */
  OPT_falign_labels_ = 410,                  /* -falign-labels= */
  OPT_falign_loops = 411,                    /* -falign-loops */
  OPT_falign_loops_ = 412,                   /* -falign-loops= */
  OPT_fall_intrinsics = 413,                 /* -fall-intrinsics */
  /* OPT_fall_virtual = 414, */              /* -fall-virtual */
  OPT_fallow_leading_underscore = 415,       /* -fallow-leading-underscore */
  OPT_fallow_parameterless_variadic_functions = 416,/* -fallow-parameterless-variadic-functions */
  /* OPT_falt_external_templates = 417, */   /* -falt-external-templates */
  /* OPT_fargument_alias = 418, */           /* -fargument-alias */
  /* OPT_fargument_noalias = 419, */         /* -fargument-noalias */
  /* OPT_fargument_noalias_anything = 420, *//* -fargument-noalias-anything */
  /* OPT_fargument_noalias_global = 421, */  /* -fargument-noalias-global */
  OPT_fasan_shadow_offset_ = 422,            /* -fasan-shadow-offset= */
  OPT_fasm = 423,                            /* -fasm */
  OPT_fassociative_math = 424,               /* -fassociative-math */
  OPT_fasynchronous_unwind_tables = 425,     /* -fasynchronous-unwind-tables */
  OPT_fauto_inc_dec = 426,                   /* -fauto-inc-dec */
  OPT_fauto_profile = 427,                   /* -fauto-profile */
  OPT_fauto_profile_ = 428,                  /* -fauto-profile= */
  OPT_fautomatic = 429,                      /* -fautomatic */
  OPT_fbackslash = 430,                      /* -fbackslash */
  OPT_fbacktrace = 431,                      /* -fbacktrace */
  OPT_fblas_matmul_limit_ = 432,             /* -fblas-matmul-limit= */
  OPT_fbounds_check = 433,                   /* -fbounds-check */
  OPT_fbranch_count_reg = 434,               /* -fbranch-count-reg */
  OPT_fbranch_probabilities = 435,           /* -fbranch-probabilities */
  OPT_fbranch_target_load_optimize = 436,    /* -fbranch-target-load-optimize */
  OPT_fbranch_target_load_optimize2 = 437,   /* -fbranch-target-load-optimize2 */
  OPT_fbtr_bb_exclusive = 438,               /* -fbtr-bb-exclusive */
  OPT_fbuilding_libgcc = 439,                /* -fbuilding-libgcc */
  OPT_fbuiltin = 440,                        /* -fbuiltin */
  OPT_fbuiltin_ = 441,                       /* -fbuiltin- */
  OPT_fcall_saved_ = 442,                    /* -fcall-saved- */
  OPT_fcall_used_ = 443,                     /* -fcall-used- */
  OPT_fcaller_saves = 444,                   /* -fcaller-saves */
  OPT_fcanonical_system_headers = 445,       /* -fcanonical-system-headers */
  OPT_fcheck_array_temporaries = 446,        /* -fcheck-array-temporaries */
  OPT_fcheck_data_deps = 447,                /* -fcheck-data-deps */
  OPT_fcheck_new = 448,                      /* -fcheck-new */
  OPT_fcheck_pointer_bounds = 449,           /* -fcheck-pointer-bounds */
  OPT_fcheck_ = 450,                         /* -fcheck= */
  OPT_fchkp_check_incomplete_type = 451,     /* -fchkp-check-incomplete-type */
  OPT_fchkp_check_read = 452,                /* -fchkp-check-read */
  OPT_fchkp_check_write = 453,               /* -fchkp-check-write */
  OPT_fchkp_first_field_has_own_bounds = 454,/* -fchkp-first-field-has-own-bounds */
  OPT_fchkp_instrument_calls = 455,          /* -fchkp-instrument-calls */
  OPT_fchkp_instrument_marked_only = 456,    /* -fchkp-instrument-marked-only */
  OPT_fchkp_narrow_bounds = 457,             /* -fchkp-narrow-bounds */
  OPT_fchkp_narrow_to_innermost_array = 458, /* -fchkp-narrow-to-innermost-array */
  OPT_fchkp_optimize = 459,                  /* -fchkp-optimize */
  OPT_fchkp_store_bounds = 460,              /* -fchkp-store-bounds */
  OPT_fchkp_treat_zero_dynamic_size_as_infinite = 461,/* -fchkp-treat-zero-dynamic-size-as-infinite */
  OPT_fchkp_use_fast_string_functions = 462, /* -fchkp-use-fast-string-functions */
  OPT_fchkp_use_nochk_string_functions = 463,/* -fchkp-use-nochk-string-functions */
  OPT_fchkp_use_static_bounds = 464,         /* -fchkp-use-static-bounds */
  OPT_fchkp_use_static_const_bounds = 465,   /* -fchkp-use-static-const-bounds */
  OPT_fchkp_use_wrappers = 466,              /* -fchkp-use-wrappers */
  OPT_fchkp_zero_input_bounds_for_main = 467,/* -fchkp-zero-input-bounds-for-main */
  OPT_fcilkplus = 468,                       /* -fcilkplus */
  OPT_fcoarray_ = 469,                       /* -fcoarray= */
  OPT_fcombine_stack_adjustments = 470,      /* -fcombine-stack-adjustments */
  OPT_fcommon = 471,                         /* -fcommon */
  OPT_fcompare_debug = 472,                  /* -fcompare-debug */
  OPT_fcompare_debug_second = 473,           /* -fcompare-debug-second */
  OPT_fcompare_debug_ = 474,                 /* -fcompare-debug= */
  OPT_fcompare_elim = 475,                   /* -fcompare-elim */
  OPT_fcond_mismatch = 476,                  /* -fcond-mismatch */
  OPT_fconserve_space = 477,                 /* -fconserve-space */
  OPT_fconserve_stack = 478,                 /* -fconserve-stack */
  OPT_fconstant_string_class_ = 479,         /* -fconstant-string-class= */
  OPT_fconstexpr_depth_ = 480,               /* -fconstexpr-depth= */
  OPT_fconvert_ = 481,                       /* -fconvert= */
  OPT_fcprop_registers = 482,                /* -fcprop-registers */
  OPT_fcray_pointer = 483,                   /* -fcray-pointer */
  OPT_fcrossjumping = 484,                   /* -fcrossjumping */
  OPT_fcse_follow_jumps = 485,               /* -fcse-follow-jumps */
  /* OPT_fcse_skip_blocks = 486, */          /* -fcse-skip-blocks */
  OPT_fcx_fortran_rules = 487,               /* -fcx-fortran-rules */
  OPT_fcx_limited_range = 488,               /* -fcx-limited-range */
  OPT_fd_lines_as_code = 489,                /* -fd-lines-as-code */
  OPT_fd_lines_as_comments = 490,            /* -fd-lines-as-comments */
  OPT_fdata_sections = 491,                  /* -fdata-sections */
  OPT_fdbg_cnt_list = 492,                   /* -fdbg-cnt-list */
  OPT_fdbg_cnt_ = 493,                       /* -fdbg-cnt= */
  OPT_fdce = 494,                            /* -fdce */
  OPT_fdebug_cpp = 495,                      /* -fdebug-cpp */
  OPT_fdebug_prefix_map_ = 496,              /* -fdebug-prefix-map= */
  OPT_fdebug_types_section = 497,            /* -fdebug-types-section */
  OPT_fdeclone_ctor_dtor = 498,              /* -fdeclone-ctor-dtor */
  OPT_fdeduce_init_list = 499,               /* -fdeduce-init-list */
  OPT_fdefault_double_8 = 500,               /* -fdefault-double-8 */
  /* OPT_fdefault_inline = 501, */           /* -fdefault-inline */
  OPT_fdefault_integer_8 = 502,              /* -fdefault-integer-8 */
  OPT_fdefault_real_8 = 503,                 /* -fdefault-real-8 */
  OPT_fdefer_pop = 504,                      /* -fdefer-pop */
  OPT_fdelayed_branch = 505,                 /* -fdelayed-branch */
  OPT_fdelete_dead_exceptions = 506,         /* -fdelete-dead-exceptions */
  OPT_fdelete_null_pointer_checks = 507,     /* -fdelete-null-pointer-checks */
  OPT_fdevirtualize = 508,                   /* -fdevirtualize */
  OPT_fdevirtualize_at_ltrans = 509,         /* -fdevirtualize-at-ltrans */
  OPT_fdevirtualize_speculatively = 510,     /* -fdevirtualize-speculatively */
  /* OPT_fdiagnostics_color = 511, */        /* -fdiagnostics-color */
  OPT_fdiagnostics_color_ = 512,             /* -fdiagnostics-color= */
  OPT_fdiagnostics_show_caret = 513,         /* -fdiagnostics-show-caret */
  OPT_fdiagnostics_show_location_ = 514,     /* -fdiagnostics-show-location= */
  OPT_fdiagnostics_show_option = 515,        /* -fdiagnostics-show-option */
  OPT_fdirectives_only = 516,                /* -fdirectives-only */
  OPT_fdisable_ = 517,                       /* -fdisable- */
  OPT_fdollar_ok = 518,                      /* -fdollar-ok */
  OPT_fdollars_in_identifiers = 519,         /* -fdollars-in-identifiers */
  OPT_fdse = 520,                            /* -fdse */
  OPT_fdump_ = 521,                          /* -fdump- */
  OPT_fdump_ada_spec = 522,                  /* -fdump-ada-spec */
  OPT_fdump_ada_spec_slim = 523,             /* -fdump-ada-spec-slim */
  /* OPT_fdump_core = 524, */                /* -fdump-core */
  OPT_fdump_final_insns = 525,               /* -fdump-final-insns */
  OPT_fdump_final_insns_ = 526,              /* -fdump-final-insns= */
  OPT_fdump_fortran_optimized = 527,         /* -fdump-fortran-optimized */
  OPT_fdump_fortran_original = 528,          /* -fdump-fortran-original */
  OPT_fdump_go_spec_ = 529,                  /* -fdump-go-spec= */
  OPT_fdump_noaddr = 530,                    /* -fdump-noaddr */
  /* OPT_fdump_parse_tree = 531, */          /* -fdump-parse-tree */
  OPT_fdump_passes = 532,                    /* -fdump-passes */
  OPT_fdump_unnumbered = 533,                /* -fdump-unnumbered */
  OPT_fdump_unnumbered_links = 534,          /* -fdump-unnumbered-links */
  OPT_fdwarf2_cfi_asm = 535,                 /* -fdwarf2-cfi-asm */
  OPT_fearly_inlining = 536,                 /* -fearly-inlining */
  OPT_felide_constructors = 537,             /* -felide-constructors */
  OPT_feliminate_dwarf2_dups = 538,          /* -feliminate-dwarf2-dups */
  OPT_feliminate_unused_debug_symbols = 539, /* -feliminate-unused-debug-symbols */
  OPT_feliminate_unused_debug_types = 540,   /* -feliminate-unused-debug-types */
  OPT_femit_class_debug_always = 541,        /* -femit-class-debug-always */
  OPT_femit_struct_debug_baseonly = 542,     /* -femit-struct-debug-baseonly */
  OPT_femit_struct_debug_detailed_ = 543,    /* -femit-struct-debug-detailed= */
  OPT_femit_struct_debug_reduced = 544,      /* -femit-struct-debug-reduced */
  OPT_fenable_ = 545,                        /* -fenable- */
  OPT_fenforce_eh_specs = 546,               /* -fenforce-eh-specs */
  /* OPT_fenum_int_equiv = 547, */           /* -fenum-int-equiv */
  OPT_fexceptions = 548,                     /* -fexceptions */
  OPT_fexcess_precision_ = 549,              /* -fexcess-precision= */
  OPT_fexec_charset_ = 550,                  /* -fexec-charset= */
  OPT_fexpensive_optimizations = 551,        /* -fexpensive-optimizations */
  OPT_fext_numeric_literals = 552,           /* -fext-numeric-literals */
  OPT_fextended_identifiers = 553,           /* -fextended-identifiers */
  OPT_fextern_tls_init = 554,                /* -fextern-tls-init */
  OPT_fexternal_blas = 555,                  /* -fexternal-blas */
  /* OPT_fexternal_templates = 556, */       /* -fexternal-templates */
  OPT_ff2c = 557,                            /* -ff2c */
  OPT_ffast_math = 558,                      /* -ffast-math */
  OPT_ffat_lto_objects = 559,                /* -ffat-lto-objects */
  OPT_ffinite_math_only = 560,               /* -ffinite-math-only */
  OPT_ffixed_ = 561,                         /* -ffixed- */
  OPT_ffixed_form = 562,                     /* -ffixed-form */
  OPT_ffixed_line_length_ = 563,             /* -ffixed-line-length- */
  OPT_ffixed_line_length_none = 564,         /* -ffixed-line-length-none */
  OPT_ffloat_store = 565,                    /* -ffloat-store */
  OPT_ffor_scope = 566,                      /* -ffor-scope */
  /* OPT_fforce_addr = 567, */               /* -fforce-addr */
  OPT_fforward_propagate = 568,              /* -fforward-propagate */
  OPT_ffp_contract_ = 569,                   /* -ffp-contract= */
  OPT_ffpe_summary_ = 570,                   /* -ffpe-summary= */
  OPT_ffpe_trap_ = 571,                      /* -ffpe-trap= */
  OPT_ffree_form = 572,                      /* -ffree-form */
  OPT_ffree_line_length_ = 573,              /* -ffree-line-length- */
  OPT_ffree_line_length_none = 574,          /* -ffree-line-length-none */
  OPT_ffreestanding = 575,                   /* -ffreestanding */
  OPT_ffriend_injection = 576,               /* -ffriend-injection */
  OPT_ffrontend_optimize = 577,              /* -ffrontend-optimize */
  OPT_ffunction_cse = 578,                   /* -ffunction-cse */
  OPT_ffunction_sections = 579,              /* -ffunction-sections */
  OPT_fgcse = 580,                           /* -fgcse */
  OPT_fgcse_after_reload = 581,              /* -fgcse-after-reload */
  OPT_fgcse_las = 582,                       /* -fgcse-las */
  OPT_fgcse_lm = 583,                        /* -fgcse-lm */
  OPT_fgcse_sm = 584,                        /* -fgcse-sm */
  OPT_fgnu_keywords = 585,                   /* -fgnu-keywords */
  OPT_fgnu_runtime = 586,                    /* -fgnu-runtime */
  OPT_fgnu_tm = 587,                         /* -fgnu-tm */
  OPT_fgnu_unique = 588,                     /* -fgnu-unique */
  OPT_fgnu89_inline = 589,                   /* -fgnu89-inline */
  OPT_fgo_check_divide_overflow = 590,       /* -fgo-check-divide-overflow */
  OPT_fgo_check_divide_zero = 591,           /* -fgo-check-divide-zero */
  OPT_fgo_dump_ = 592,                       /* -fgo-dump- */
  OPT_fgo_optimize_ = 593,                   /* -fgo-optimize- */
  OPT_fgo_pkgpath_ = 594,                    /* -fgo-pkgpath= */
  OPT_fgo_prefix_ = 595,                     /* -fgo-prefix= */
  OPT_fgo_relative_import_path_ = 596,       /* -fgo-relative-import-path= */
  OPT_fgraphite = 597,                       /* -fgraphite */
  OPT_fgraphite_identity = 598,              /* -fgraphite-identity */
  OPT_fguess_branch_probability = 599,       /* -fguess-branch-probability */
  /* OPT_fguiding_decls = 600, */            /* -fguiding-decls */
  /* OPT_fhandle_exceptions = 601, */        /* -fhandle-exceptions */
  /* OPT_fhelp = 602, */                     /* -fhelp */
  /* OPT_fhelp_ = 603, */                    /* -fhelp= */
  OPT_fhoist_adjacent_loads = 604,           /* -fhoist-adjacent-loads */
  /* OPT_fhonor_std = 605, */                /* -fhonor-std */
  OPT_fhosted = 606,                         /* -fhosted */
  /* OPT_fhuge_objects = 607, */             /* -fhuge-objects */
  OPT_fident = 608,                          /* -fident */
  OPT_fif_conversion = 609,                  /* -fif-conversion */
  OPT_fif_conversion2 = 610,                 /* -fif-conversion2 */
  OPT_fimplement_inlines = 611,              /* -fimplement-inlines */
  OPT_fimplicit_inline_templates = 612,      /* -fimplicit-inline-templates */
  OPT_fimplicit_none = 613,                  /* -fimplicit-none */
  OPT_fimplicit_templates = 614,             /* -fimplicit-templates */
  OPT_findirect_inlining = 615,              /* -findirect-inlining */
  OPT_finhibit_size_directive = 616,         /* -finhibit-size-directive */
  OPT_finit_character_ = 617,                /* -finit-character= */
  OPT_finit_integer_ = 618,                  /* -finit-integer= */
  OPT_finit_local_zero = 619,                /* -finit-local-zero */
  OPT_finit_logical_ = 620,                  /* -finit-logical= */
  OPT_finit_real_ = 621,                     /* -finit-real= */
  OPT_finline = 622,                         /* -finline */
  OPT_finline_atomics = 623,                 /* -finline-atomics */
  OPT_finline_functions = 624,               /* -finline-functions */
  OPT_finline_functions_called_once = 625,   /* -finline-functions-called-once */
  /* OPT_finline_limit_ = 626, */            /* -finline-limit- */
  OPT_finline_limit_ = 627,                  /* -finline-limit= */
  OPT_finline_small_functions = 628,         /* -finline-small-functions */
  OPT_finput_charset_ = 629,                 /* -finput-charset= */
  OPT_finstrument_functions = 630,           /* -finstrument-functions */
  OPT_finstrument_functions_exclude_file_list_ = 631,/* -finstrument-functions-exclude-file-list= */
  OPT_finstrument_functions_exclude_function_list_ = 632,/* -finstrument-functions-exclude-function-list= */
  OPT_finteger_4_integer_8 = 633,            /* -finteger-4-integer-8 */
  OPT_fintrinsic_modules_path = 634,         /* -fintrinsic-modules-path */
  OPT_fintrinsic_modules_path_ = 635,        /* -fintrinsic-modules-path= */
  OPT_fipa_cp = 636,                         /* -fipa-cp */
  OPT_fipa_cp_alignment = 637,               /* -fipa-cp-alignment */
  OPT_fipa_cp_clone = 638,                   /* -fipa-cp-clone */
  OPT_fipa_icf = 639,                        /* -fipa-icf */
  OPT_fipa_icf_functions = 640,              /* -fipa-icf-functions */
  OPT_fipa_icf_variables = 641,              /* -fipa-icf-variables */
  /* OPT_fipa_matrix_reorg = 642, */         /* -fipa-matrix-reorg */
  OPT_fipa_profile = 643,                    /* -fipa-profile */
  OPT_fipa_pta = 644,                        /* -fipa-pta */
  OPT_fipa_pure_const = 645,                 /* -fipa-pure-const */
  OPT_fipa_ra = 646,                         /* -fipa-ra */
  OPT_fipa_reference = 647,                  /* -fipa-reference */
  OPT_fipa_sra = 648,                        /* -fipa-sra */
  /* OPT_fipa_struct_reorg = 649, */         /* -fipa-struct-reorg */
  OPT_fira_algorithm_ = 650,                 /* -fira-algorithm= */
  OPT_fira_hoist_pressure = 651,             /* -fira-hoist-pressure */
  OPT_fira_loop_pressure = 652,              /* -fira-loop-pressure */
  OPT_fira_region_ = 653,                    /* -fira-region= */
  OPT_fira_share_save_slots = 654,           /* -fira-share-save-slots */
  OPT_fira_share_spill_slots = 655,          /* -fira-share-spill-slots */
  OPT_fira_verbose_ = 656,                   /* -fira-verbose= */
  OPT_fisolate_erroneous_paths_attribute = 657,/* -fisolate-erroneous-paths-attribute */
  OPT_fisolate_erroneous_paths_dereference = 658,/* -fisolate-erroneous-paths-dereference */
  OPT_fivar_visibility_ = 659,               /* -fivar-visibility= */
  OPT_fivopts = 660,                         /* -fivopts */
  OPT_fjump_tables = 661,                    /* -fjump-tables */
  OPT_fkeep_inline_dllexport = 662,          /* -fkeep-inline-dllexport */
  OPT_fkeep_inline_functions = 663,          /* -fkeep-inline-functions */
  OPT_fkeep_static_consts = 664,             /* -fkeep-static-consts */
  /* OPT_flabels_ok = 665, */                /* -flabels-ok */
  OPT_flax_vector_conversions = 666,         /* -flax-vector-conversions */
  OPT_fleading_underscore = 667,             /* -fleading-underscore */
  OPT_flifetime_dse = 668,                   /* -flifetime-dse */
  OPT_flive_range_shrinkage = 669,           /* -flive-range-shrinkage */
  OPT_flocal_ivars = 670,                    /* -flocal-ivars */
  OPT_floop_block = 671,                     /* -floop-block */
  /* OPT_floop_flatten = 672, */             /* -floop-flatten */
  OPT_floop_interchange = 673,               /* -floop-interchange */
  OPT_floop_nest_optimize = 674,             /* -floop-nest-optimize */
  /* OPT_floop_optimize = 675, */            /* -floop-optimize */
  OPT_floop_parallelize_all = 676,           /* -floop-parallelize-all */
  OPT_floop_strip_mine = 677,                /* -floop-strip-mine */
  OPT_floop_unroll_and_jam = 678,            /* -floop-unroll-and-jam */
  OPT_flra_remat = 679,                      /* -flra-remat */
  OPT_flto = 680,                            /* -flto */
  OPT_flto_compression_level_ = 681,         /* -flto-compression-level= */
  OPT_flto_odr_type_merging = 682,           /* -flto-odr-type-merging */
  OPT_flto_partition_ = 683,                 /* -flto-partition= */
  OPT_flto_report = 684,                     /* -flto-report */
  OPT_flto_report_wpa = 685,                 /* -flto-report-wpa */
  OPT_flto_ = 686,                           /* -flto= */
  OPT_fltrans = 687,                         /* -fltrans */
  OPT_fltrans_output_list_ = 688,            /* -fltrans-output-list= */
  OPT_fmath_errno = 689,                     /* -fmath-errno */
  OPT_fmax_array_constructor_ = 690,         /* -fmax-array-constructor= */
  OPT_fmax_errors_ = 691,                    /* -fmax-errors= */
  OPT_fmax_identifier_length_ = 692,         /* -fmax-identifier-length= */
  OPT_fmax_stack_var_size_ = 693,            /* -fmax-stack-var-size= */
  OPT_fmax_subrecord_length_ = 694,          /* -fmax-subrecord-length= */
  OPT_fmem_report = 695,                     /* -fmem-report */
  OPT_fmem_report_wpa = 696,                 /* -fmem-report-wpa */
  OPT_fmerge_all_constants = 697,            /* -fmerge-all-constants */
  OPT_fmerge_constants = 698,                /* -fmerge-constants */
  OPT_fmerge_debug_strings = 699,            /* -fmerge-debug-strings */
  OPT_fmessage_length_ = 700,                /* -fmessage-length= */
  OPT_fmodule_private = 701,                 /* -fmodule-private */
  OPT_fmodulo_sched = 702,                   /* -fmodulo-sched */
  OPT_fmodulo_sched_allow_regmoves = 703,    /* -fmodulo-sched-allow-regmoves */
