technicalinformatics/msp430gcc/lib/gcc/msp430-elf/5.3.0/plugin/include/options.h
  OPT_fmove_loop_invariants = 704,           /* -fmove-loop-invariants */
  OPT_fms_extensions = 705,                  /* -fms-extensions */
  /* OPT_fmudflap = 706, */                  /* -fmudflap */
  /* OPT_fmudflapir = 707, */                /* -fmudflapir */
  /* OPT_fmudflapth = 708, */                /* -fmudflapth */
  /* OPT_fname_mangling_version_ = 709, */   /* -fname-mangling-version- */
  /* OPT_fnew_abi = 710, */                  /* -fnew-abi */
  OPT_fnext_runtime = 711,                   /* -fnext-runtime */
  OPT_fnil_receivers = 712,                  /* -fnil-receivers */
  /* OPT_fno_vect_cost_model = 713, */       /* -fno-vect-cost-model */
  OPT_fnon_call_exceptions = 714,            /* -fnon-call-exceptions */
  OPT_fnonansi_builtins = 715,               /* -fnonansi-builtins */
  /* OPT_fnonnull_objects = 716, */          /* -fnonnull-objects */
  OPT_fnothrow_opt = 717,                    /* -fnothrow-opt */
  OPT_fobjc_abi_version_ = 718,              /* -fobjc-abi-version= */
  OPT_fobjc_call_cxx_cdtors = 719,           /* -fobjc-call-cxx-cdtors */
  OPT_fobjc_direct_dispatch = 720,           /* -fobjc-direct-dispatch */
  OPT_fobjc_exceptions = 721,                /* -fobjc-exceptions */
  OPT_fobjc_gc = 722,                        /* -fobjc-gc */
  OPT_fobjc_nilcheck = 723,                  /* -fobjc-nilcheck */
  OPT_fobjc_sjlj_exceptions = 724,           /* -fobjc-sjlj-exceptions */
  OPT_fobjc_std_objc1 = 725,                 /* -fobjc-std=objc1 */
  OPT_foffload_abi_ = 726,                   /* -foffload-abi= */
  OPT_foffload_ = 727,                       /* -foffload= */
  OPT_fomit_frame_pointer = 728,             /* -fomit-frame-pointer */
  OPT_fopenacc = 729,                        /* -fopenacc */
  OPT_fopenmp = 730,                         /* -fopenmp */
  OPT_fopenmp_simd = 731,                    /* -fopenmp-simd */
  OPT_foperator_names = 732,                 /* -foperator-names */
  OPT_fopt_info = 733,                       /* -fopt-info */
  OPT_fopt_info_ = 734,                      /* -fopt-info- */
  /* OPT_foptimize_register_move = 735, */   /* -foptimize-register-move */
  OPT_foptimize_sibling_calls = 736,         /* -foptimize-sibling-calls */
  OPT_foptimize_strlen = 737,                /* -foptimize-strlen */
  /* OPT_foptional_diags = 738, */           /* -foptional-diags */
  OPT_fpack_derived = 739,                   /* -fpack-derived */
  OPT_fpack_struct = 740,                    /* -fpack-struct */
  OPT_fpack_struct_ = 741,                   /* -fpack-struct= */
  OPT_fpartial_inlining = 742,               /* -fpartial-inlining */
  OPT_fpcc_struct_return = 743,              /* -fpcc-struct-return */
  OPT_fpch_deps = 744,                       /* -fpch-deps */
  OPT_fpch_preprocess = 745,                 /* -fpch-preprocess */
  OPT_fpeel_loops = 746,                     /* -fpeel-loops */
  OPT_fpeephole = 747,                       /* -fpeephole */
  OPT_fpeephole2 = 748,                      /* -fpeephole2 */
  OPT_fpermissive = 749,                     /* -fpermissive */
  OPT_fpic = 750,                            /* -fpic */
  OPT_fpie = 751,                            /* -fpie */
  OPT_fplan9_extensions = 752,               /* -fplan9-extensions */
  OPT_fplugin_arg_ = 753,                    /* -fplugin-arg- */
  OPT_fplugin_ = 754,                        /* -fplugin= */
  OPT_fpost_ipa_mem_report = 755,            /* -fpost-ipa-mem-report */
  OPT_fpre_ipa_mem_report = 756,             /* -fpre-ipa-mem-report */
  OPT_fpredictive_commoning = 757,           /* -fpredictive-commoning */
  OPT_fprefetch_loop_arrays = 758,           /* -fprefetch-loop-arrays */
  OPT_fpreprocessed = 759,                   /* -fpreprocessed */
  OPT_fpretty_templates = 760,               /* -fpretty-templates */
  OPT_fprofile = 761,                        /* -fprofile */
  OPT_fprofile_arcs = 762,                   /* -fprofile-arcs */
  OPT_fprofile_correction = 763,             /* -fprofile-correction */
  OPT_fprofile_dir_ = 764,                   /* -fprofile-dir= */
  OPT_fprofile_generate = 765,               /* -fprofile-generate */
  OPT_fprofile_generate_ = 766,              /* -fprofile-generate= */
  OPT_fprofile_reorder_functions = 767,      /* -fprofile-reorder-functions */
  OPT_fprofile_report = 768,                 /* -fprofile-report */
  OPT_fprofile_use = 769,                    /* -fprofile-use */
  OPT_fprofile_use_ = 770,                   /* -fprofile-use= */
  OPT_fprofile_values = 771,                 /* -fprofile-values */
  OPT_fprotect_parens = 772,                 /* -fprotect-parens */
  OPT_frandom_seed = 773,                    /* -frandom-seed */
  OPT_frandom_seed_ = 774,                   /* -frandom-seed= */
  OPT_frange_check = 775,                    /* -frange-check */
  OPT_freal_4_real_10 = 776,                 /* -freal-4-real-10 */
  OPT_freal_4_real_16 = 777,                 /* -freal-4-real-16 */
  OPT_freal_4_real_8 = 778,                  /* -freal-4-real-8 */
  OPT_freal_8_real_10 = 779,                 /* -freal-8-real-10 */
  OPT_freal_8_real_16 = 780,                 /* -freal-8-real-16 */
  OPT_freal_8_real_4 = 781,                  /* -freal-8-real-4 */
  OPT_frealloc_lhs = 782,                    /* -frealloc-lhs */
  OPT_freciprocal_math = 783,                /* -freciprocal-math */
  OPT_frecord_gcc_switches = 784,            /* -frecord-gcc-switches */
  OPT_frecord_marker_4 = 785,                /* -frecord-marker=4 */
  OPT_frecord_marker_8 = 786,                /* -frecord-marker=8 */
  OPT_frecursive = 787,                      /* -frecursive */
  OPT_free = 788,                            /* -free */
  OPT_freg_struct_return = 789,              /* -freg-struct-return */
  /* OPT_fregmove = 790, */                  /* -fregmove */
  OPT_frename_registers = 791,               /* -frename-registers */
  OPT_freorder_blocks = 792,                 /* -freorder-blocks */
  OPT_freorder_blocks_and_partition = 793,   /* -freorder-blocks-and-partition */
  OPT_freorder_functions = 794,              /* -freorder-functions */
  OPT_frepack_arrays = 795,                  /* -frepack-arrays */
  OPT_freplace_objc_classes = 796,           /* -freplace-objc-classes */
  OPT_frepo = 797,                           /* -frepo */
  OPT_freport_bug = 798,                     /* -freport-bug */
  OPT_frequire_return_statement = 799,       /* -frequire-return-statement */
  OPT_frerun_cse_after_loop = 800,           /* -frerun-cse-after-loop */
  /* OPT_frerun_loop_opt = 801, */           /* -frerun-loop-opt */
  OPT_freschedule_modulo_scheduled_loops = 802,/* -freschedule-modulo-scheduled-loops */
  OPT_fresolution_ = 803,                    /* -fresolution= */
  OPT_frounding_math = 804,                  /* -frounding-math */
  OPT_frtti = 805,                           /* -frtti */
  OPT_fsanitize_recover = 806,               /* -fsanitize-recover */
  OPT_fsanitize_recover_ = 807,              /* -fsanitize-recover= */
  OPT_fsanitize_undefined_trap_on_error = 808,/* -fsanitize-undefined-trap-on-error */
  OPT_fsanitize_ = 809,                      /* -fsanitize= */
  OPT_fsched_critical_path_heuristic = 810,  /* -fsched-critical-path-heuristic */
  OPT_fsched_dep_count_heuristic = 811,      /* -fsched-dep-count-heuristic */
  OPT_fsched_group_heuristic = 812,          /* -fsched-group-heuristic */
  OPT_fsched_interblock = 813,               /* -fsched-interblock */
  OPT_fsched_last_insn_heuristic = 814,      /* -fsched-last-insn-heuristic */
  OPT_fsched_pressure = 815,                 /* -fsched-pressure */
  OPT_fsched_rank_heuristic = 816,           /* -fsched-rank-heuristic */
  OPT_fsched_spec = 817,                     /* -fsched-spec */
  OPT_fsched_spec_insn_heuristic = 818,      /* -fsched-spec-insn-heuristic */
  OPT_fsched_spec_load = 819,                /* -fsched-spec-load */
  OPT_fsched_spec_load_dangerous = 820,      /* -fsched-spec-load-dangerous */
  OPT_fsched_stalled_insns = 821,            /* -fsched-stalled-insns */
  OPT_fsched_stalled_insns_dep = 822,        /* -fsched-stalled-insns-dep */
  OPT_fsched_stalled_insns_dep_ = 823,       /* -fsched-stalled-insns-dep= */
  OPT_fsched_stalled_insns_ = 824,           /* -fsched-stalled-insns= */
  OPT_fsched_verbose_ = 825,                 /* -fsched-verbose= */
  OPT_fsched2_use_superblocks = 826,         /* -fsched2-use-superblocks */
  /* OPT_fsched2_use_traces = 827, */        /* -fsched2-use-traces */
  OPT_fschedule_fusion = 828,                /* -fschedule-fusion */
  OPT_fschedule_insns = 829,                 /* -fschedule-insns */
  OPT_fschedule_insns2 = 830,                /* -fschedule-insns2 */
  OPT_fsecond_underscore = 831,              /* -fsecond-underscore */
  OPT_fsection_anchors = 832,                /* -fsection-anchors */
  /* OPT_fsee = 833, */                      /* -fsee */
  OPT_fsel_sched_pipelining = 834,           /* -fsel-sched-pipelining */
  OPT_fsel_sched_pipelining_outer_loops = 835,/* -fsel-sched-pipelining-outer-loops */
  OPT_fsel_sched_reschedule_pipelined = 836, /* -fsel-sched-reschedule-pipelined */
  OPT_fselective_scheduling = 837,           /* -fselective-scheduling */
  OPT_fselective_scheduling2 = 838,          /* -fselective-scheduling2 */
  OPT_fsemantic_interposition = 839,         /* -fsemantic-interposition */
  OPT_fshort_double = 840,                   /* -fshort-double */
  OPT_fshort_enums = 841,                    /* -fshort-enums */
  OPT_fshort_wchar = 842,                    /* -fshort-wchar */
  OPT_fshow_column = 843,                    /* -fshow-column */
  OPT_fshrink_wrap = 844,                    /* -fshrink-wrap */
  OPT_fsign_zero = 845,                      /* -fsign-zero */
  OPT_fsignaling_nans = 846,                 /* -fsignaling-nans */
  OPT_fsigned_bitfields = 847,               /* -fsigned-bitfields */
  OPT_fsigned_char = 848,                    /* -fsigned-char */
  OPT_fsigned_zeros = 849,                   /* -fsigned-zeros */
  OPT_fsimd_cost_model_ = 850,               /* -fsimd-cost-model= */
  OPT_fsingle_precision_constant = 851,      /* -fsingle-precision-constant */
  OPT_fsized_deallocation = 852,             /* -fsized-deallocation */
  OPT_fsplit_ivs_in_unroller = 853,          /* -fsplit-ivs-in-unroller */
  OPT_fsplit_stack = 854,                    /* -fsplit-stack */
  OPT_fsplit_wide_types = 855,               /* -fsplit-wide-types */
  /* OPT_fsquangle = 856, */                 /* -fsquangle */
  OPT_fssa_phiopt = 857,                     /* -fssa-phiopt */
  OPT_fstack_arrays = 858,                   /* -fstack-arrays */
  /* OPT_fstack_check = 859, */              /* -fstack-check */
  OPT_fstack_check_ = 860,                   /* -fstack-check= */
  OPT_fstack_limit = 861,                    /* -fstack-limit */
  OPT_fstack_limit_register_ = 862,          /* -fstack-limit-register= */
  OPT_fstack_limit_symbol_ = 863,            /* -fstack-limit-symbol= */
  OPT_fstack_protector = 864,                /* -fstack-protector */
  OPT_fstack_protector_all = 865,            /* -fstack-protector-all */
  OPT_fstack_protector_explicit = 866,       /* -fstack-protector-explicit */
  OPT_fstack_protector_strong = 867,         /* -fstack-protector-strong */
  OPT_fstack_reuse_ = 868,                   /* -fstack-reuse= */
  OPT_fstack_usage = 869,                    /* -fstack-usage */
  OPT_fstats = 870,                          /* -fstats */
  OPT_fstdarg_opt = 871,                     /* -fstdarg-opt */
  /* OPT_fstrength_reduce = 872, */          /* -fstrength-reduce */
  OPT_fstrict_aliasing = 873,                /* -fstrict-aliasing */
  OPT_fstrict_enums = 874,                   /* -fstrict-enums */
  OPT_fstrict_overflow = 875,                /* -fstrict-overflow */
  /* OPT_fstrict_prototype = 876, */         /* -fstrict-prototype */
  OPT_fstrict_volatile_bitfields = 877,      /* -fstrict-volatile-bitfields */
  OPT_fsync_libcalls = 878,                  /* -fsync-libcalls */
  OPT_fsyntax_only = 879,                    /* -fsyntax-only */
  OPT_ftabstop_ = 880,                       /* -ftabstop= */
  /* OPT_ftarget_help = 881, */              /* -ftarget-help */
  OPT_ftemplate_backtrace_limit_ = 882,      /* -ftemplate-backtrace-limit= */
  /* OPT_ftemplate_depth_ = 883, */          /* -ftemplate-depth- */
  OPT_ftemplate_depth_ = 884,                /* -ftemplate-depth= */
  OPT_ftest_coverage = 885,                  /* -ftest-coverage */
  /* OPT_fthis_is_variable = 886, */         /* -fthis-is-variable */
  OPT_fthread_jumps = 887,                   /* -fthread-jumps */
  OPT_fthreadsafe_statics = 888,             /* -fthreadsafe-statics */
  OPT_ftime_report = 889,                    /* -ftime-report */
  OPT_ftls_model_ = 890,                     /* -ftls-model= */
  OPT_ftoplevel_reorder = 891,               /* -ftoplevel-reorder */
  OPT_ftracer = 892,                         /* -ftracer */
  OPT_ftrack_macro_expansion = 893,          /* -ftrack-macro-expansion */
  OPT_ftrack_macro_expansion_ = 894,         /* -ftrack-macro-expansion= */
  OPT_ftrapping_math = 895,                  /* -ftrapping-math */
  OPT_ftrapv = 896,                          /* -ftrapv */
  OPT_ftree_bit_ccp = 897,                   /* -ftree-bit-ccp */
  OPT_ftree_builtin_call_dce = 898,          /* -ftree-builtin-call-dce */
  OPT_ftree_ccp = 899,                       /* -ftree-ccp */
  OPT_ftree_ch = 900,                        /* -ftree-ch */
  OPT_ftree_coalesce_inlined_vars = 901,     /* -ftree-coalesce-inlined-vars */
  OPT_ftree_coalesce_vars = 902,             /* -ftree-coalesce-vars */
  OPT_ftree_copy_prop = 903,                 /* -ftree-copy-prop */
  OPT_ftree_copyrename = 904,                /* -ftree-copyrename */
  OPT_ftree_cselim = 905,                    /* -ftree-cselim */
  OPT_ftree_dce = 906,                       /* -ftree-dce */
  OPT_ftree_dominator_opts = 907,            /* -ftree-dominator-opts */
  OPT_ftree_dse = 908,                       /* -ftree-dse */
  OPT_ftree_forwprop = 909,                  /* -ftree-forwprop */
  OPT_ftree_fre = 910,                       /* -ftree-fre */
  OPT_ftree_loop_distribute_patterns = 911,  /* -ftree-loop-distribute-patterns */
  OPT_ftree_loop_distribution = 912,         /* -ftree-loop-distribution */
  OPT_ftree_loop_if_convert = 913,           /* -ftree-loop-if-convert */
  OPT_ftree_loop_if_convert_stores = 914,    /* -ftree-loop-if-convert-stores */
  OPT_ftree_loop_im = 915,                   /* -ftree-loop-im */
  OPT_ftree_loop_ivcanon = 916,              /* -ftree-loop-ivcanon */
  /* OPT_ftree_loop_linear = 917, */         /* -ftree-loop-linear */
  OPT_ftree_loop_optimize = 918,             /* -ftree-loop-optimize */
  OPT_ftree_loop_vectorize = 919,            /* -ftree-loop-vectorize */
  OPT_ftree_lrs = 920,                       /* -ftree-lrs */
  OPT_ftree_parallelize_loops_ = 921,        /* -ftree-parallelize-loops= */
  OPT_ftree_partial_pre = 922,               /* -ftree-partial-pre */
  OPT_ftree_phiprop = 923,                   /* -ftree-phiprop */
  OPT_ftree_pre = 924,                       /* -ftree-pre */
  OPT_ftree_pta = 925,                       /* -ftree-pta */
  OPT_ftree_reassoc = 926,                   /* -ftree-reassoc */
  /* OPT_ftree_salias = 927, */              /* -ftree-salias */
  OPT_ftree_scev_cprop = 928,                /* -ftree-scev-cprop */
  OPT_ftree_sink = 929,                      /* -ftree-sink */
  OPT_ftree_slp_vectorize = 930,             /* -ftree-slp-vectorize */
  OPT_ftree_slsr = 931,                      /* -ftree-slsr */
  OPT_ftree_sra = 932,                       /* -ftree-sra */
  /* OPT_ftree_store_ccp = 933, */           /* -ftree-store-ccp */
  /* OPT_ftree_store_copy_prop = 934, */     /* -ftree-store-copy-prop */
  OPT_ftree_switch_conversion = 935,         /* -ftree-switch-conversion */
  OPT_ftree_tail_merge = 936,                /* -ftree-tail-merge */
  OPT_ftree_ter = 937,                       /* -ftree-ter */
  /* OPT_ftree_vect_loop_version = 938, */   /* -ftree-vect-loop-version */
  OPT_ftree_vectorize = 939,                 /* -ftree-vectorize */
  /* OPT_ftree_vectorizer_verbose_ = 940, */ /* -ftree-vectorizer-verbose= */
  OPT_ftree_vrp = 941,                       /* -ftree-vrp */
  OPT_funderscoring = 942,                   /* -funderscoring */
  OPT_funit_at_a_time = 943,                 /* -funit-at-a-time */
  OPT_funroll_all_loops = 944,               /* -funroll-all-loops */
  OPT_funroll_loops = 945,                   /* -funroll-loops */
  OPT_funsafe_loop_optimizations = 946,      /* -funsafe-loop-optimizations */
  OPT_funsafe_math_optimizations = 947,      /* -funsafe-math-optimizations */
  OPT_funsigned_bitfields = 948,             /* -funsigned-bitfields */
  OPT_funsigned_char = 949,                  /* -funsigned-char */
  OPT_funswitch_loops = 950,                 /* -funswitch-loops */
  OPT_funwind_tables = 951,                  /* -funwind-tables */
  OPT_fuse_cxa_atexit = 952,                 /* -fuse-cxa-atexit */
  OPT_fuse_cxa_get_exception_ptr = 953,      /* -fuse-cxa-get-exception-ptr */
  OPT_fuse_ld_bfd = 954,                     /* -fuse-ld=bfd */
  OPT_fuse_ld_gold = 955,                    /* -fuse-ld=gold */
  OPT_fuse_linker_plugin = 956,              /* -fuse-linker-plugin */
  OPT_fvar_tracking = 957,                   /* -fvar-tracking */
  OPT_fvar_tracking_assignments = 958,       /* -fvar-tracking-assignments */
  OPT_fvar_tracking_assignments_toggle = 959,/* -fvar-tracking-assignments-toggle */
  OPT_fvar_tracking_uninit = 960,            /* -fvar-tracking-uninit */
  OPT_fvariable_expansion_in_unroller = 961, /* -fvariable-expansion-in-unroller */
  /* OPT_fvect_cost_model = 962, */          /* -fvect-cost-model */
  OPT_fvect_cost_model_ = 963,               /* -fvect-cost-model= */
  OPT_fverbose_asm = 964,                    /* -fverbose-asm */
  /* OPT_fversion = 965, */                  /* -fversion */
  OPT_fvisibility_inlines_hidden = 966,      /* -fvisibility-inlines-hidden */
  OPT_fvisibility_ms_compat = 967,           /* -fvisibility-ms-compat */
  OPT_fvisibility_ = 968,                    /* -fvisibility= */
  OPT_fvpt = 969,                            /* -fvpt */
  /* OPT_fvtable_gc = 970, */                /* -fvtable-gc */
  /* OPT_fvtable_thunks = 971, */            /* -fvtable-thunks */
  OPT_fvtable_verify_ = 972,                 /* -fvtable-verify= */
  OPT_fvtv_counts = 973,                     /* -fvtv-counts */
  OPT_fvtv_debug = 974,                      /* -fvtv-debug */
  OPT_fweak = 975,                           /* -fweak */
  OPT_fweb = 976,                            /* -fweb */
  /* OPT_fwhole_file = 977, */               /* -fwhole-file */
  OPT_fwhole_program = 978,                  /* -fwhole-program */
  OPT_fwide_exec_charset_ = 979,             /* -fwide-exec-charset= */
  OPT_fworking_directory = 980,              /* -fworking-directory */
  OPT_fwpa = 981,                            /* -fwpa */
  OPT_fwpa_ = 982,                           /* -fwpa= */
  OPT_fwrapv = 983,                          /* -fwrapv */
  /* OPT_fxref = 984, */                     /* -fxref */
  /* OPT_fzee = 985, */                      /* -fzee */
  OPT_fzero_initialized_in_bss = 986,        /* -fzero-initialized-in-bss */
  OPT_fzero_link = 987,                      /* -fzero-link */
  OPT_g = 988,                               /* -g */
  OPT_gcoff = 989,                           /* -gcoff */
  OPT_gdwarf = 990,                          /* -gdwarf */
  OPT_gdwarf_ = 991,                         /* -gdwarf- */
  OPT_gen_decls = 992,                       /* -gen-decls */
  OPT_ggdb = 993,                            /* -ggdb */
  OPT_ggnu_pubnames = 994,                   /* -ggnu-pubnames */
  OPT_gno_pubnames = 995,                    /* -gno-pubnames */
  OPT_gno_record_gcc_switches = 996,         /* -gno-record-gcc-switches */
  OPT_gno_split_dwarf = 997,                 /* -gno-split-dwarf */
  OPT_gno_strict_dwarf = 998,                /* -gno-strict-dwarf */
  OPT_gpubnames = 999,                       /* -gpubnames */
  OPT_grecord_gcc_switches = 1000,           /* -grecord-gcc-switches */
  OPT_gsplit_dwarf = 1001,                   /* -gsplit-dwarf */
  OPT_gstabs = 1002,                         /* -gstabs */
  OPT_gstabs_ = 1003,                        /* -gstabs+ */
  OPT_gstrict_dwarf = 1004,                  /* -gstrict-dwarf */
  OPT_gtoggle = 1005,                        /* -gtoggle */
  OPT_gvms = 1006,                           /* -gvms */
  OPT_gxcoff = 1007,                         /* -gxcoff */
  OPT_gxcoff_ = 1008,                        /* -gxcoff+ */
  OPT_gz = 1009,                             /* -gz */
  OPT_gz_ = 1010,                            /* -gz= */
  OPT_h = 1011,                              /* -h */
  OPT_idirafter = 1012,                      /* -idirafter */
  OPT_imacros = 1013,                        /* -imacros */
  OPT_imultiarch = 1014,                     /* -imultiarch */
  OPT_imultilib = 1015,                      /* -imultilib */
  OPT_include = 1016,                        /* -include */
  OPT_iplugindir_ = 1017,                    /* -iplugindir= */
  OPT_iprefix = 1018,                        /* -iprefix */
  OPT_iquote = 1019,                         /* -iquote */
  OPT_isysroot = 1020,                       /* -isysroot */
  OPT_isystem = 1021,                        /* -isystem */
  OPT_iwithprefix = 1022,                    /* -iwithprefix */
  OPT_iwithprefixbefore = 1023,              /* -iwithprefixbefore */
  OPT_l = 1024,                              /* -l */
  OPT_lang_asm = 1025,                       /* -lang-asm */
  OPT_mOs = 1026,                            /* -mOs */
  OPT_masm_hex = 1027,                       /* -masm-hex */
  OPT_mcode_region_ = 1028,                  /* -mcode-region= */
  OPT_mcpu_ = 1029,                          /* -mcpu= */
  OPT_mdata_region_ = 1030,                  /* -mdata-region= */
  OPT_mhwmult_ = 1031,                       /* -mhwmult= */
  OPT_minrt = 1032,                          /* -minrt */
  OPT_mlarge = 1033,                         /* -mlarge */
  OPT_mmcu_ = 1034,                          /* -mmcu= */
  OPT_mrelax = 1035,                         /* -mrelax */
  OPT_msilicon_errata_warn_ = 1036,          /* -msilicon-errata-warn= */
  OPT_msilicon_errata_ = 1037,               /* -msilicon-errata= */
  OPT_msim = 1038,                           /* -msim */
  OPT_msmall = 1039,                         /* -msmall */
  OPT_mwarn_mcu = 1040,                      /* -mwarn-mcu */
  OPT_n = 1041,                              /* -n */
  OPT_no_canonical_prefixes = 1042,          /* -no-canonical-prefixes */
  OPT_no_integrated_cpp = 1043,              /* -no-integrated-cpp */
  OPT_nocpp = 1044,                          /* -nocpp */
  OPT_nodefaultlibs = 1045,                  /* -nodefaultlibs */
  OPT_nostartfiles = 1046,                   /* -nostartfiles */
  OPT_nostdinc = 1047,                       /* -nostdinc */
  OPT_nostdinc__ = 1048,                     /* -nostdinc++ */
  OPT_nostdlib = 1049,                       /* -nostdlib */
  OPT_o = 1050,                              /* -o */
  OPT_p = 1051,                              /* -p */
  OPT_pass_exit_codes = 1052,                /* -pass-exit-codes */
  /* OPT_pedantic = 1053, */                 /* -pedantic */
  OPT_pedantic_errors = 1054,                /* -pedantic-errors */
  OPT_pg = 1055,                             /* -pg */
  OPT_pie = 1056,                            /* -pie */
  OPT_pipe = 1057,                           /* -pipe */
  OPT_print_file_name_ = 1058,               /* -print-file-name= */
  OPT_print_libgcc_file_name = 1059,         /* -print-libgcc-file-name */
