technicalinformatics/msp430gcc/lib/gcc/msp430-elf/5.3.0/plugin/include/options.h
  OPT_print_multi_directory = 1060,          /* -print-multi-directory */
  OPT_print_multi_lib = 1061,                /* -print-multi-lib */
  OPT_print_multi_os_directory = 1062,       /* -print-multi-os-directory */
  OPT_print_multiarch = 1063,                /* -print-multiarch */
  OPT_print_objc_runtime_info = 1064,        /* -print-objc-runtime-info */
  OPT_print_prog_name_ = 1065,               /* -print-prog-name= */
  OPT_print_search_dirs = 1066,              /* -print-search-dirs */
  OPT_print_sysroot = 1067,                  /* -print-sysroot */
  OPT_print_sysroot_headers_suffix = 1068,   /* -print-sysroot-headers-suffix */
  OPT_quiet = 1069,                          /* -quiet */
  OPT_r = 1070,                              /* -r */
  OPT_remap = 1071,                          /* -remap */
  OPT_s = 1072,                              /* -s */
  OPT_save_temps = 1073,                     /* -save-temps */
  OPT_save_temps_ = 1074,                    /* -save-temps= */
  OPT_shared = 1075,                         /* -shared */
  OPT_shared_libgcc = 1076,                  /* -shared-libgcc */
  /* OPT_specs = 1077, */                    /* -specs */
  OPT_specs_ = 1078,                         /* -specs= */
  OPT_static = 1079,                         /* -static */
  OPT_static_libasan = 1080,                 /* -static-libasan */
  OPT_static_libgcc = 1081,                  /* -static-libgcc */
  OPT_static_libgfortran = 1082,             /* -static-libgfortran */
  OPT_static_libgo = 1083,                   /* -static-libgo */
  OPT_static_liblsan = 1084,                 /* -static-liblsan */
  OPT_static_libmpx = 1085,                  /* -static-libmpx */
  OPT_static_libmpxwrappers = 1086,          /* -static-libmpxwrappers */
  OPT_static_libstdc__ = 1087,               /* -static-libstdc++ */
  OPT_static_libtsan = 1088,                 /* -static-libtsan */
  OPT_static_libubsan = 1089,                /* -static-libubsan */
  /* OPT_std_c__03 = 1090, */                /* -std=c++03 */
  /* OPT_std_c__0x = 1091, */                /* -std=c++0x */
  OPT_std_c__11 = 1092,                      /* -std=c++11 */
  OPT_std_c__14 = 1093,                      /* -std=c++14 */
  /* OPT_std_c__17 = 1094, */                /* -std=c++17 */
  /* OPT_std_c__1y = 1095, */                /* -std=c++1y */
  OPT_std_c__1z = 1096,                      /* -std=c++1z */
  OPT_std_c__98 = 1097,                      /* -std=c++98 */
  OPT_std_c11 = 1098,                        /* -std=c11 */
  /* OPT_std_c1x = 1099, */                  /* -std=c1x */
  /* OPT_std_c89 = 1100, */                  /* -std=c89 */
  OPT_std_c90 = 1101,                        /* -std=c90 */
  OPT_std_c99 = 1102,                        /* -std=c99 */
  /* OPT_std_c9x = 1103, */                  /* -std=c9x */
  OPT_std_f2003 = 1104,                      /* -std=f2003 */
  OPT_std_f2008 = 1105,                      /* -std=f2008 */
  OPT_std_f2008ts = 1106,                    /* -std=f2008ts */
  OPT_std_f95 = 1107,                        /* -std=f95 */
  OPT_std_gnu = 1108,                        /* -std=gnu */
  /* OPT_std_gnu__03 = 1109, */              /* -std=gnu++03 */
  /* OPT_std_gnu__0x = 1110, */              /* -std=gnu++0x */
  OPT_std_gnu__11 = 1111,                    /* -std=gnu++11 */
  OPT_std_gnu__14 = 1112,                    /* -std=gnu++14 */
  /* OPT_std_gnu__17 = 1113, */              /* -std=gnu++17 */
  /* OPT_std_gnu__1y = 1114, */              /* -std=gnu++1y */
  OPT_std_gnu__1z = 1115,                    /* -std=gnu++1z */
  OPT_std_gnu__98 = 1116,                    /* -std=gnu++98 */
  OPT_std_gnu11 = 1117,                      /* -std=gnu11 */
  /* OPT_std_gnu1x = 1118, */                /* -std=gnu1x */
  /* OPT_std_gnu89 = 1119, */                /* -std=gnu89 */
  OPT_std_gnu90 = 1120,                      /* -std=gnu90 */
  OPT_std_gnu99 = 1121,                      /* -std=gnu99 */
  /* OPT_std_gnu9x = 1122, */                /* -std=gnu9x */
  /* OPT_std_iso9899_1990 = 1123, */         /* -std=iso9899:1990 */
  OPT_std_iso9899_199409 = 1124,             /* -std=iso9899:199409 */
  /* OPT_std_iso9899_1999 = 1125, */         /* -std=iso9899:1999 */
  /* OPT_std_iso9899_199x = 1126, */         /* -std=iso9899:199x */
  /* OPT_std_iso9899_2011 = 1127, */         /* -std=iso9899:2011 */
  OPT_std_legacy = 1128,                     /* -std=legacy */
  OPT_symbolic = 1129,                       /* -symbolic */
  OPT_t = 1130,                              /* -t */
  OPT_time = 1131,                           /* -time */
  OPT_time_ = 1132,                          /* -time= */
  OPT_traditional = 1133,                    /* -traditional */
  OPT_traditional_cpp = 1134,                /* -traditional-cpp */
  OPT_trigraphs = 1135,                      /* -trigraphs */
  OPT_u = 1136,                              /* -u */
  OPT_undef = 1137,                          /* -undef */
  OPT_v = 1138,                              /* -v */
  OPT_version = 1139,                        /* -version */
  OPT_w = 1140,                              /* -w */
  OPT_wrapper = 1141,                        /* -wrapper */
  OPT_x = 1142,                              /* -x */
  OPT_z = 1143,                              /* -z */
  N_OPTS,
  OPT_SPECIAL_unknown,
  OPT_SPECIAL_ignore,
  OPT_SPECIAL_program_name,
  OPT_SPECIAL_input_file
};

#ifdef GCC_C_COMMON_C
/* Mapping from cpp message reasons to the options that enable them.  */
#include <cpplib.h>
struct cpp_reason_option_codes_t
{
  const int reason;		/* cpplib message reason.  */
  const int option_code;	/* gcc option that controls this message.  */
};

static const struct cpp_reason_option_codes_t cpp_reason_option_codes[] = {
  {CPP_W_BUILTIN_MACRO_REDEFINED,           OPT_Wbuiltin_macro_redefined},
  {CPP_W_CXX_OPERATOR_NAMES,                OPT_Wc___compat},
  {CPP_W_C90_C99_COMPAT,                    OPT_Wc90_c99_compat},
  {CPP_W_COMMENTS,                          OPT_Wcomment},
  {CPP_W_WARNING_DIRECTIVE,                 OPT_Wcpp},
  {CPP_W_DATE_TIME,                         OPT_Wdate_time},
  {CPP_W_DEPRECATED,                        OPT_Wdeprecated},
  {CPP_W_ENDIF_LABELS,                      OPT_Wendif_labels},
  {CPP_W_INVALID_PCH,                       OPT_Winvalid_pch},
  {CPP_W_LITERAL_SUFFIX,                    OPT_Wliteral_suffix},
  {CPP_W_LONG_LONG,                         OPT_Wlong_long},
  {CPP_W_MISSING_INCLUDE_DIRS,              OPT_Wmissing_include_dirs},
  {CPP_W_MULTICHAR,                         OPT_Wmultichar},
  {CPP_W_NORMALIZE,                         OPT_Wnormalized_},
  {CPP_W_PEDANTIC,                          OPT_Wpedantic},
  {CPP_W_TRADITIONAL,                       OPT_Wtraditional},
  {CPP_W_TRIGRAPHS,                         OPT_Wtrigraphs},
  {CPP_W_UNDEF,                             OPT_Wundef},
  {CPP_W_UNUSED_MACROS,                     OPT_Wunused_macros},
  {CPP_W_VARIADIC_MACROS,                   OPT_Wvariadic_macros},
  {CPP_W_NONE,                              0},
};
#endif

#endif /* OPTIONS_H */
